digitie/canview/firmware/communicator/stm32/platform/stm32g474/uart_dma.c
/* SPDX-License-Identifier: GPL-3.0-only */
/** @file uart_dma.c
 * @brief STM32G474 USART2 DMA/IRQ adapter for the T-104 UART owner.
 */
#include "uart_dma.h"

#include "board_pins.h"
#include "core_hw.h"
#include "stm32g474xx.h"
#include "stm32g4xx_ll_dmamux.h"

#include <string.h>

#if CANVIEW_BOARD_ESP_RTS_PORT != 0U || CANVIEW_BOARD_ESP_RTS_PIN != 0U || \
    CANVIEW_BOARD_STM_RTS_SRC_PORT != 0U || CANVIEW_BOARD_STM_RTS_SRC_PIN != 1U || \
    CANVIEW_BOARD_STM_TX_SRC_PORT != 0U || CANVIEW_BOARD_STM_TX_SRC_PIN != 2U || \
    CANVIEW_BOARD_ESP_TX_PORT != 0U || CANVIEW_BOARD_ESP_TX_PIN != 3U
#error Invalid_R1_USART2_pin_contract
#endif

#if CANVIEW_STM_UART_PLATFORM_RX_CAPACITY > UINT16_MAX
#error USART2_DMA_RX_capacity_must_fit_CNDTR
#endif

#define CANVIEW_STM_UART_GPIO_PIN_MASK (UINT32_C(0x0000000f))
#define CANVIEW_STM_UART_GPIO_MODE_MASK (UINT32_C(0x000000ff))
#define CANVIEW_STM_UART_GPIO_ALTERNATE_MASK (UINT32_C(0x0000ffff))
#define CANVIEW_STM_UART_GPIO_ALTERNATE_VALUE (UINT32_C(0x00007777))
#define CANVIEW_STM_UART_GPIO_ALTERNATE_MODE (UINT32_C(0x000000aa))
#define CANVIEW_STM_UART_GPIO_HIGH_SPEED (UINT32_C(0x000000ff))

#define CANVIEW_STM_UART_DMA_RX_REQUEST (LL_DMAMUX_REQ_USART2_RX)
#define CANVIEW_STM_UART_DMA_TX_REQUEST (LL_DMAMUX_REQ_USART2_TX)
#define CANVIEW_STM_UART_DMA_PRIORITY (DMA_CCR_PL_0 | DMA_CCR_PL_1)

#define CANVIEW_STM_UART_USART_ERROR_FLAGS \
    (USART_ISR_PE | USART_ISR_FE | USART_ISR_NE | USART_ISR_ORE)
#define CANVIEW_STM_UART_USART_ERROR_CLEAR \
    (USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NECF | USART_ICR_ORECF)

#define CANVIEW_STM_UART_RX_DMA_FLAGS \
    (DMA_ISR_TCIF1 | DMA_ISR_HTIF1 | DMA_ISR_TEIF1)
#define CANVIEW_STM_UART_TX_DMA_FLAGS \
    (DMA_ISR_TCIF2 | DMA_ISR_TEIF2)
#define CANVIEW_STM_UART_RX_DMA_CLEAR \
    (DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1 | DMA_IFCR_CGIF1)
#define CANVIEW_STM_UART_TX_DMA_CLEAR \
    (DMA_IFCR_CTCIF2 | DMA_IFCR_CTEIF2 | DMA_IFCR_CGIF2)

#if defined(CANVIEW_STM_UART_PLATFORM_TEST)
extern volatile uint32_t canview_test_stm_uid[3];
#define CANVIEW_STM_UART_ID_UID_BASE ((uintptr_t)canview_test_stm_uid)
#else
#define CANVIEW_STM_UART_ID_UID_BASE (0x1fff7590UL)
#endif
#define CANVIEW_STM_UART_POLL_LIMIT (UINT32_C(100000))

/* This adapter is a hardware singleton: there is one USART2 and one DMA pair. */
static canview_stm_uart_platform_t *volatile active_platform;

static bool wait_register(volatile const uint32_t *address, uint32_t mask,
                          uint32_t expected)
{
    if (address == NULL)
    {
        return false;
    }
    for (uint32_t attempt = 0U; attempt < CANVIEW_STM_UART_POLL_LIMIT; ++attempt)
    {
        __DMB();
        if ((*address & mask) == expected)
        {
            return true;
        }
    }
    return false;
}

static void post_event(canview_stm_uart_platform_t *platform, uint32_t event)
{
    if (platform != NULL && event != 0U)
    {
        __DMB();
        platform->events |= event;
    }
}

static bool clock_ready(void)
{
    return (RCC->CR & (RCC_CR_HSERDY | RCC_CR_PLLRDY)) ==
               (RCC_CR_HSERDY | RCC_CR_PLLRDY) &&
           (RCC->CFGR & RCC_CFGR_SWS) == RCC_CFGR_SWS_PLL &&
           (RCC->CCIPR & RCC_CCIPR_USART2SEL) == 0U;
}

static void configure_uart_gpio(void)
{
    RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN;
    (void)RCC->AHB2ENR;
    GPIOA->AFR[0] = (GPIOA->AFR[0] & ~CANVIEW_STM_UART_GPIO_ALTERNATE_MASK) |
                    CANVIEW_STM_UART_GPIO_ALTERNATE_VALUE;
    GPIOA->PUPDR &= ~CANVIEW_STM_UART_GPIO_MODE_MASK;
    GPIOA->OTYPER &= ~CANVIEW_STM_UART_GPIO_PIN_MASK;
    GPIOA->OSPEEDR = (GPIOA->OSPEEDR & ~CANVIEW_STM_UART_GPIO_MODE_MASK) |
                     CANVIEW_STM_UART_GPIO_HIGH_SPEED;
    GPIOA->MODER = (GPIOA->MODER & ~CANVIEW_STM_UART_GPIO_MODE_MASK) |
                   CANVIEW_STM_UART_GPIO_ALTERNATE_MODE;
}

static void configure_uart_gpio_input(void)
{
    GPIOA->MODER &= ~CANVIEW_STM_UART_GPIO_MODE_MASK;
    GPIOA->PUPDR &= ~CANVIEW_STM_UART_GPIO_MODE_MASK;
    GPIOA->OTYPER &= ~CANVIEW_STM_UART_GPIO_PIN_MASK;
    GPIOA->AFR[0] &= ~CANVIEW_STM_UART_GPIO_ALTERNATE_MASK;
}

static void clear_dma_flags(void)
{
    DMA1->IFCR = CANVIEW_STM_UART_RX_DMA_CLEAR | CANVIEW_STM_UART_TX_DMA_CLEAR;
}

static void disable_dma(void)
{
    DMA1_Channel1->CCR &= ~DMA_CCR_EN;
    DMA1_Channel2->CCR &= ~DMA_CCR_EN;
    DMA1->IFCR = CANVIEW_STM_UART_RX_DMA_CLEAR | CANVIEW_STM_UART_TX_DMA_CLEAR;
}

static void disable_usart(void)
{
    USART2->CR1 = 0U;
    USART2->CR3 = 0U;
    USART2->ICR = CANVIEW_STM_UART_USART_ERROR_CLEAR | USART_ICR_IDLECF | USART_ICR_CTSCF;
    USART2->RQR = USART_RQR_RXFRQ | USART_RQR_TXFRQ;
}

static void reset_adapter_counters(canview_stm_uart_platform_t *platform)
{
    platform->rx_read_total = 0U;
    platform->rx_wrap_count_isr = 0U;
    platform->events = 0U;
    platform->rx_error_pending = false;
    platform->tx_error_pending = false;
    platform->tx_done_pending = false;
    platform->tx_in_flight = false;
    platform->servicing = false;
    platform->irq_quiesced = false;
}

static void configure_dma_requests(void)
{
    DMAMUX1_Channel0->CCR = CANVIEW_STM_UART_DMA_RX_REQUEST;
    DMAMUX1_Channel1->CCR = CANVIEW_STM_UART_DMA_TX_REQUEST;
}

static void configure_dma_channels(const uint8_t *rx_buffer)
{
    DMA1_Channel1->CCR = 0U;
    DMA1_Channel2->CCR = 0U;
    DMA1_Channel1->CPAR = (uint32_t)(uintptr_t)&USART2->RDR;
    DMA1_Channel1->CMAR = (uint32_t)(uintptr_t)rx_buffer;
    DMA1_Channel1->CNDTR = (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY;
    DMA1_Channel1->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_HTIE | DMA_CCR_TCIE |
                         DMA_CCR_TEIE | CANVIEW_STM_UART_DMA_PRIORITY;

    DMA1_Channel2->CPAR = (uint32_t)(uintptr_t)&USART2->TDR;
    DMA1_Channel2->CMAR = 0U;
    DMA1_Channel2->CNDTR = 0U;
    DMA1_Channel2->CCR = DMA_CCR_DIR | DMA_CCR_MINC | DMA_CCR_TCIE | DMA_CCR_TEIE |
                         CANVIEW_STM_UART_DMA_PRIORITY;
}

static void configure_usart(void)
{
    USART2->CR1 = 0U;
    USART2->CR2 = 0U;
    USART2->CR3 = 0U;
    USART2->BRR = CANVIEW_STM_UART_BRR;
    USART2->PRESC = 0U;
    USART2->ICR = CANVIEW_STM_UART_USART_ERROR_CLEAR | USART_ICR_IDLECF | USART_ICR_CTSCF;
    USART2->RQR = USART_RQR_RXFRQ | USART_RQR_TXFRQ;
    USART2->CR3 = USART_CR3_EIE | USART_CR3_DMAR | USART_CR3_DMAT | USART_CR3_RTSE |
                  USART_CR3_CTSE | USART_CR3_CTSIE | USART_CR3_DDRE;
    USART2->CR1 = USART_CR1_UE | USART_CR1_RE | USART_CR1_TE | USART_CR1_IDLEIE;
}

static void enable_interrupts(void)
{
    NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
    NVIC_ClearPendingIRQ(USART2_IRQn);
    NVIC_SetPriority(DMA1_Channel1_IRQn, UINT32_C(5));
    NVIC_SetPriority(DMA1_Channel2_IRQn, UINT32_C(5));
    NVIC_SetPriority(USART2_IRQn, UINT32_C(5));
    NVIC_EnableIRQ(DMA1_Channel1_IRQn);
    NVIC_EnableIRQ(DMA1_Channel2_IRQn);
    NVIC_EnableIRQ(USART2_IRQn);
}

