digitie/canview/firmware/communicator/stm32/platform/stm32g474/uart_dma.c
static void disable_interrupts(void)
{
    NVIC_DisableIRQ(DMA1_Channel1_IRQn);
    NVIC_DisableIRQ(DMA1_Channel2_IRQn);
    NVIC_DisableIRQ(USART2_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
    NVIC_ClearPendingIRQ(USART2_IRQn);
}

static void clear_pending_events(canview_stm_uart_platform_t *platform)
{
    if (platform == NULL)
    {
        return;
    }
    const uint32_t saved_mask = canview_stm_critical_enter(NULL);
    platform->events = 0U;
    platform->rx_error_pending = false;
    platform->tx_error_pending = false;
    platform->tx_done_pending = false;
    canview_stm_critical_leave(NULL, saved_mask);
}

static bool begin_irq_quiesce(canview_stm_uart_platform_t *platform)
{
    if (platform == NULL || platform->irq_quiesced)
    {
        return false;
    }
    disable_interrupts();
    platform->irq_quiesced = true;
    return true;
}

static void end_irq_quiesce(canview_stm_uart_platform_t *platform, bool owned)
{
    if (platform == NULL || !owned)
    {
        return;
    }
    NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
    NVIC_ClearPendingIRQ(USART2_IRQn);
    enable_interrupts();
    platform->irq_quiesced = false;
}

static bool cts_is_blocked(void)
{
    /* The external ESP32 RTS output is active-low and pulled high at reset. */
    return (GPIOA->IDR & (UINT32_C(1) << CANVIEW_BOARD_ESP_RTS_PIN)) != 0U;
}

static bool sample_rx_total(const canview_stm_uart_platform_t *platform,
                            uint64_t *producer_total)
{
    if (platform == NULL || producer_total == NULL)
    {
        return false;
    }
    for (size_t attempt = 0U; attempt < 3U; ++attempt)
    {
        const uint32_t wraps_before = platform->rx_wrap_count_isr;
        const uint32_t remaining = DMA1_Channel1->CNDTR;
        __DMB();
        const uint32_t wraps_after = platform->rx_wrap_count_isr;
        if (wraps_before != wraps_after)
        {
            continue;
        }
        if (remaining > CANVIEW_STM_UART_PLATFORM_RX_CAPACITY)
        {
            return false;
        }
        const uint32_t position = remaining == 0U
                                       ? (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY
                                       : (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY - remaining;
        const uint32_t capacity = (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY;
        if ((uint64_t)wraps_before > UINT64_MAX / (uint64_t)capacity)
        {
            return false;
        }
        uint64_t total = (uint64_t)wraps_before * (uint64_t)capacity + position;
        /* A transfer-complete IRQ can be pending while CNDTR already wrapped. */
        if (total < platform->rx_read_total)
        {
            const uint64_t lag = platform->rx_read_total - total;
            if (lag > capacity || total > UINT64_MAX - capacity)
            {
                return false;
            }
            total += capacity;
        }
        *producer_total = total;
        return true;
    }
    return false;
}

static uint32_t take_events(canview_stm_uart_platform_t *platform, bool *rx_error,
                            bool *tx_error, bool *tx_done)
{
    const uint32_t saved_mask = canview_stm_critical_enter(NULL);
    const uint32_t events = platform->events;
    *rx_error = platform->rx_error_pending;
    *tx_error = platform->tx_error_pending;
    *tx_done = platform->tx_done_pending;
    platform->events = 0U;
    platform->rx_error_pending = false;
    platform->tx_error_pending = false;
    platform->tx_done_pending = false;
    canview_stm_critical_leave(NULL, saved_mask);
    return events;
}

static canview_status_t abort_tx_dma(canview_stm_uart_platform_t *platform)
{
    if (platform == NULL)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    DMA1_Channel2->CCR &= ~DMA_CCR_EN;
    USART2->CR3 &= ~USART_CR3_DMAT;
    __DSB();
    if (!wait_register(&DMA1_Channel2->CCR, DMA_CCR_EN, 0U))
    {
        return CANVIEW_TIMEOUT;
    }
    DMA1->IFCR = CANVIEW_STM_UART_TX_DMA_CLEAR;
    __DSB();
    platform->tx_in_flight = false;
    return CANVIEW_OK;
}

static canview_status_t runtime_reset_hook(void *opaque)
{
    canview_stm_uart_platform_t *const platform =
        (canview_stm_uart_platform_t *)opaque;
    if (platform == NULL)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    const uint32_t saved_mask = canview_stm_critical_enter(NULL);
    const canview_status_t status = abort_tx_dma(platform);
    if (status == CANVIEW_OK)
    {
        /* No completion/error from the old transfer may be consumed after reset. */
        platform->tx_done_pending = false;
        platform->tx_error_pending = false;
        platform->events &= ~(uint32_t)(CANVIEW_STM_UART_PLATFORM_EVENT_TX_DONE |
                                       CANVIEW_STM_UART_PLATFORM_EVENT_TX_ERROR);
        NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
    }
    canview_stm_critical_leave(NULL, saved_mask);
    return status;
}

static void record_rx_recovery(canview_stm_uart_platform_t *platform,
                               canview_stm_uart_rx_recovery_reason_t reason,
                               uint64_t discarded_bytes, bool loss_unknown)
{
    if (platform == NULL)
    {
        return;
    }
    if (platform->rx_recovery_count != UINT32_MAX)
    {
        ++platform->rx_recovery_count;
    }
    if (reason == CANVIEW_STM_UART_RX_RECOVERY_DMA_OR_USART_ERROR &&
        platform->rx_error_recovery_count != UINT32_MAX)
    {
        ++platform->rx_error_recovery_count;
    }
    if (reason == CANVIEW_STM_UART_RX_RECOVERY_RING_OVERRUN &&
        platform->rx_overrun_recovery_count != UINT32_MAX)
    {
        ++platform->rx_overrun_recovery_count;
    }
    if (discarded_bytes > UINT64_MAX - platform->rx_discarded_bytes)
    {
        platform->rx_discarded_bytes = UINT64_MAX;
    }
    else
    {
        platform->rx_discarded_bytes += discarded_bytes;
    }
    if (loss_unknown && platform->rx_unknown_loss_count != UINT32_MAX)
    {
        ++platform->rx_unknown_loss_count;
    }
    platform->last_rx_recovery_reason = reason;
}

