digitie/canview/firmware/communicator/stm32/platform/stm32g474/uart_dma.c
static canview_status_t reset_rx_dma(canview_stm_uart_platform_t *platform,
                                     uint64_t now_ms, uint64_t now_us,
                                     canview_stm_uart_rx_recovery_reason_t reason,
                                     uint64_t discarded_bytes, bool loss_unknown)
{
    canview_status_t result = CANVIEW_OK;
    record_rx_recovery(platform, reason, discarded_bytes, loss_unknown);
    const bool owns_quiesce = begin_irq_quiesce(platform);
    const canview_status_t tx_abort_status = abort_tx_dma(platform);
    DMA1_Channel1->CCR &= ~DMA_CCR_EN;
    USART2->CR3 &= ~USART_CR3_DMAR;
    DMA1->IFCR = CANVIEW_STM_UART_RX_DMA_CLEAR;
    USART2->ICR = CANVIEW_STM_UART_USART_ERROR_CLEAR | USART_ICR_IDLECF | USART_ICR_CTSCF;
    USART2->RQR = USART_RQR_RXFRQ;
    if (tx_abort_status != CANVIEW_OK)
    {
        result = tx_abort_status;
    }
    else
    {
        result = canview_stm_uart_reset(platform->config.runtime, now_ms, now_us);
    }
    if (result == CANVIEW_OK)
    {
        memset(platform->config.rx_buffer, 0, platform->config.rx_capacity);
        DMA1_Channel1->CPAR = (uint32_t)(uintptr_t)&USART2->RDR;
        DMA1_Channel1->CMAR = (uint32_t)(uintptr_t)platform->config.rx_buffer;
        DMA1_Channel1->CNDTR = (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY;
        DMA1_Channel1->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_HTIE | DMA_CCR_TCIE |
                             DMA_CCR_TEIE | CANVIEW_STM_UART_DMA_PRIORITY;
        DMA1_Channel1->CCR |= DMA_CCR_EN;
        USART2->CR3 |= USART_CR3_DMAR;
        platform->rx_read_total = 0U;
        platform->rx_wrap_count_isr = 0U;
        platform->events = 0U;
        platform->rx_error_pending = false;
        platform->tx_error_pending = false;
        platform->tx_done_pending = false;
    }
    if (tx_abort_status == CANVIEW_OK)
    {
        clear_pending_events(platform);
    }
    end_irq_quiesce(platform, owns_quiesce);
    return result;
}

static bool input_status_nonfatal(canview_status_t status)
{
    switch (status)
    {
    case CANVIEW_OK:
    case CANVIEW_INCOMPLETE:
    case CANVIEW_MALFORMED:
    case CANVIEW_UNSUPPORTED_VERSION:
    case CANVIEW_UNSUPPORTED_MESSAGE:
    case CANVIEW_CRC_MISMATCH:
    case CANVIEW_OVERSIZE:
    case CANVIEW_DUPLICATE:
    case CANVIEW_STALE:
    case CANVIEW_NOT_IMPLEMENTED:
    case CANVIEW_AUTH_FAILED:
    case CANVIEW_RESOURCE_BUSY:
    case CANVIEW_TIMEOUT:
        return true;
    default:
        return false;
    }
}

static canview_status_t consume_rx(canview_stm_uart_platform_t *platform, uint64_t producer_total,
                                   uint64_t now_ms, uint64_t now_us, size_t rx_budget)
{
    const uint64_t available = producer_total - platform->rx_read_total;
    if (available > (uint64_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY)
    {
        return CANVIEW_OVERSIZE;
    }
    const uint64_t bounded_budget = (uint64_t)rx_budget;
    const uint64_t count = available < bounded_budget ? available : bounded_budget;
    __DMB();
    for (uint64_t index = 0U; index < count; ++index)
    {
        const uint32_t buffer_index =
            (uint32_t)(platform->rx_read_total &
                       ((uint64_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY - UINT64_C(1)));
        const uint8_t byte = platform->config.rx_buffer[buffer_index];
        const canview_status_t status = canview_stm_uart_ingest_byte(
            platform->config.runtime, byte, now_ms, now_us);
        platform->rx_read_total++;
        if (!input_status_nonfatal(status))
        {
            return status;
        }
    }
    return CANVIEW_OK;
}

static canview_status_t start_tx_dma(canview_stm_uart_platform_t *platform)
{
    const uint8_t *data = NULL;
    size_t size = 0U;
    uint32_t sequence = 0U;
    const canview_status_t begin_status =
        canview_stm_uart_tx_begin(platform->config.runtime, &data, &size, &sequence);
    (void)sequence;
    if (begin_status == CANVIEW_INCOMPLETE)
    {
        return CANVIEW_OK;
    }
    if (begin_status != CANVIEW_OK || data == NULL || size == 0U || size > UINT16_MAX)
    {
        return begin_status == CANVIEW_OK ? CANVIEW_MALFORMED : begin_status;
    }
    const canview_status_t quiesce_status = abort_tx_dma(platform);
    if (quiesce_status != CANVIEW_OK)
    {
        return quiesce_status;
    }
    DMA1_Channel2->CMAR = (uint32_t)(uintptr_t)data;
    DMA1_Channel2->CNDTR = (uint32_t)size;
    DMA1_Channel2->CCR = DMA_CCR_DIR | DMA_CCR_MINC | DMA_CCR_TCIE | DMA_CCR_TEIE |
                         CANVIEW_STM_UART_DMA_PRIORITY;
    __DMB();
    USART2->CR3 |= USART_CR3_DMAT;
    DMA1_Channel2->CCR |= DMA_CCR_EN;
    platform->tx_in_flight = true;
    return CANVIEW_OK;
}

canview_status_t canview_stm_uart_platform_init(
    canview_stm_uart_platform_t *platform,
    const canview_stm_uart_platform_config_t *config)
{
    if (platform == NULL || config == NULL || config->runtime == NULL ||
        !config->runtime->initialized || config->rx_buffer == NULL ||
        config->rx_capacity != CANVIEW_STM_UART_PLATFORM_RX_CAPACITY ||
        (((uintptr_t)config->rx_buffer & (uintptr_t)3U) != 0U))
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (platform->initialized || active_platform != NULL)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    memset(platform, 0, sizeof(*platform));
    platform->config = *config;
    platform->initialized = true;
    return CANVIEW_OK;
}

canview_status_t canview_stm_uart_platform_start(canview_stm_uart_platform_t *platform)
{
    if (platform == NULL || !platform->initialized || platform->config.runtime == NULL ||
        !platform->config.runtime->initialized)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (platform->started || platform->servicing || active_platform != NULL || !clock_ready())
    {
        return platform->started || platform->servicing || active_platform != NULL
                   ? CANVIEW_RESOURCE_BUSY
                   : CANVIEW_INVALID_ARGUMENT;
    }
    const canview_status_t reset_status = canview_stm_uart_reset(
        platform->config.runtime, canview_stm_now_ms64(NULL),
        canview_stm_now_us64(NULL));
    if (reset_status != CANVIEW_OK)
    {
        return reset_status;
    }
    const canview_status_t hook_status = canview_stm_uart_set_reset_hook(
        platform->config.runtime, runtime_reset_hook, platform);
    if (hook_status != CANVIEW_OK)
    {
        return hook_status;
    }
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN | RCC_AHB1ENR_DMAMUX1EN;
    RCC->APB1ENR1 |= RCC_APB1ENR1_USART2EN;
    (void)RCC->AHB1ENR;
    (void)RCC->APB1ENR1;
    configure_uart_gpio();
    disable_dma();
    disable_usart();
    clear_dma_flags();
    configure_dma_requests();
    configure_dma_channels(platform->config.rx_buffer);
    configure_usart();
    DMA1_Channel1->CCR |= DMA_CCR_EN;
    reset_adapter_counters(platform);
    platform->started = true;
    platform->events = CANVIEW_STM_UART_PLATFORM_EVENT_CTS;
    active_platform = platform;
    enable_interrupts();
    return CANVIEW_OK;
}

