digitie/canview/firmware/communicator/stm32/platform/stm32g474/uart_dma.c
canview_status_t canview_stm_uart_platform_stop(canview_stm_uart_platform_t *platform)
{
    if (platform == NULL || !platform->initialized)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (active_platform != NULL && active_platform != platform)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    if (platform->servicing)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    (void)begin_irq_quiesce(platform);
    if (active_platform == platform)
    {
        active_platform = NULL;
    }
    const canview_status_t abort_status = abort_tx_dma(platform);
    disable_dma();
    disable_usart();
    configure_uart_gpio_input();
    clear_pending_events(platform);
    platform->started = false;
    reset_adapter_counters(platform);
    const canview_status_t hook_status = canview_stm_uart_set_reset_hook(
        platform->config.runtime, NULL, NULL);
    if (abort_status != CANVIEW_OK)
    {
        return abort_status;
    }
    return hook_status;
}

canview_status_t canview_stm_uart_platform_service(canview_stm_uart_platform_t *platform,
                                                    uint64_t now_ms, uint64_t now_us,
                                                    size_t rx_budget)
{
    if (platform == NULL || !platform->initialized || !platform->started ||
        platform->config.runtime == NULL || !platform->config.runtime->initialized ||
        rx_budget == 0U)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (platform->servicing)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    platform->servicing = true;
    bool rx_error = false;
    bool tx_error = false;
    bool tx_done = false;
    const uint32_t events = take_events(platform, &rx_error, &tx_error, &tx_done);
    (void)events;

    uint64_t producer_total = 0U;
    const bool producer_valid = sample_rx_total(platform, &producer_total);
    uint64_t discarded_bytes = 0U;
    bool loss_unknown = !producer_valid;
    if (producer_valid)
    {
        if (producer_total >= platform->rx_read_total)
        {
            discarded_bytes = producer_total - platform->rx_read_total;
        }
        else
        {
            loss_unknown = true;
        }
    }
    canview_status_t result = CANVIEW_OK;
    bool reset_happened = false;
    if (!producer_valid || producer_total < platform->rx_read_total || rx_error)
    {
        if (!producer_valid || producer_total < platform->rx_read_total)
        {
            producer_total = platform->rx_read_total;
        }
        const canview_status_t recovery_status =
            reset_rx_dma(platform, now_ms, now_us,
                         rx_error ? CANVIEW_STM_UART_RX_RECOVERY_DMA_OR_USART_ERROR
                                  : CANVIEW_STM_UART_RX_RECOVERY_CNDTR_INVALID,
                         discarded_bytes, loss_unknown);
        reset_happened = true;
        if (recovery_status != CANVIEW_OK)
        {
            result = recovery_status;
            goto service_done;
        }
        producer_total = platform->rx_read_total;
    }
    else if (producer_total - platform->rx_read_total >
             (uint64_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY)
    {
        const canview_status_t recovery_status =
            reset_rx_dma(platform, now_ms, now_us,
                         CANVIEW_STM_UART_RX_RECOVERY_RING_OVERRUN,
                         producer_total - platform->rx_read_total, false);
        reset_happened = true;
        if (recovery_status != CANVIEW_OK)
        {
            result = recovery_status;
            goto service_done;
        }
        producer_total = platform->rx_read_total;
    }

    if (tx_error)
    {
        if (platform->tx_in_flight)
        {
            const canview_status_t abort_status = abort_tx_dma(platform);
            if (abort_status != CANVIEW_OK)
            {
                result = abort_status;
                goto service_done;
            }
            const canview_status_t finish_status = canview_stm_uart_tx_finish(
                platform->config.runtime, CANVIEW_TIMEOUT, now_ms);
            if (finish_status != CANVIEW_TIMEOUT)
            {
                result = finish_status;
                goto service_done;
            }
        }
        const canview_status_t reset_status =
            canview_stm_uart_reset(platform->config.runtime, now_ms, now_us);
        reset_happened = true;
        if (reset_status != CANVIEW_OK)
        {
            result = reset_status;
            goto service_done;
        }
    }
    else if (tx_done && platform->tx_in_flight)
    {
        platform->tx_in_flight = false;
        USART2->CR3 &= ~USART_CR3_DMAT;
        __DSB();
        const canview_status_t finish_status =
            canview_stm_uart_tx_finish(platform->config.runtime, CANVIEW_OK, now_ms);
        if (finish_status != CANVIEW_OK)
        {
            result = finish_status;
            goto service_done;
        }
    }

    if (!reset_happened)
    {
        const canview_status_t rx_status =
            consume_rx(platform, producer_total, now_ms, now_us, rx_budget);
        if (rx_status != CANVIEW_OK)
        {
            result = rx_status;
            goto service_done;
        }
    }

    const bool sampled_cts_blocked = cts_is_blocked();
    if (reset_happened || !platform->config.runtime->cts_known ||
        platform->config.runtime->cts_blocked != sampled_cts_blocked ||
        (events & CANVIEW_STM_UART_PLATFORM_EVENT_CTS) != 0U)
    {
        const canview_status_t cts_status = canview_stm_uart_set_cts_blocked(
            platform->config.runtime, sampled_cts_blocked, now_ms);
        if (cts_status != CANVIEW_OK && cts_status != CANVIEW_TIMEOUT)
        {
            result = cts_status;
            goto service_done;
        }
    }

    const canview_status_t tick_status =
        canview_stm_uart_tick(platform->config.runtime, now_ms, now_us);
    if (tick_status != CANVIEW_OK)
    {
        result = tick_status;
        goto service_done;
    }
    if (!platform->tx_in_flight)
    {
        const canview_status_t tx_status = start_tx_dma(platform);
        if (tx_status != CANVIEW_OK)
        {
            result = tx_status;
            goto service_done;
        }
    }

