digitie/canview/firmware/communicator/stm32/platform/stm32g474/uart_dma.c
service_done:
    platform->servicing = false;
    return result;
}

uint64_t canview_stm_uart_platform_device_id(void)
{
    const volatile uint32_t *const uid = (const volatile uint32_t *)CANVIEW_STM_UART_ID_UID_BASE;
    uint32_t hash = UINT32_C(2166136261);
    for (size_t index = 0U; index < 3U; ++index)
    {
        const uint32_t word = uid[index];
        for (size_t byte = 0U; byte < 4U; ++byte)
        {
            hash ^= (word >> (byte * 8U)) & UINT32_C(0xff);
            hash *= UINT32_C(16777619);
        }
    }
    return hash == 0U ? UINT64_C(0) : ((uint64_t)hash << 32U) | (uint64_t)(hash ^ UINT32_C(0xa5a5a5a5));
}

uint64_t canview_stm_uart_platform_boot_id(void)
{
    RCC->CRRCR |= RCC_CRRCR_HSI48ON;
    if (!wait_register(&RCC->CRRCR, RCC_CRRCR_HSI48RDY, RCC_CRRCR_HSI48RDY))
    {
        return UINT64_C(0);
    }
    RCC->CCIPR = (RCC->CCIPR & ~RCC_CCIPR_CLK48SEL);
    (void)RCC->CCIPR;
    RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
    (void)RCC->AHB2ENR;
    RNG->CR |= RNG_CR_RNGEN;
    uint32_t words[2] = {0U, 0U};
    for (size_t index = 0U; index < 2U; ++index)
    {
        bool ready = false;
        for (uint32_t attempt = 0U; attempt < CANVIEW_STM_UART_POLL_LIMIT; ++attempt)
        {
            const uint32_t status = RNG->SR;
            if ((status & (RNG_SR_CECS | RNG_SR_SECS)) != 0U)
            {
                return UINT64_C(0);
            }
            if ((status & RNG_SR_DRDY) != 0U)
            {
                words[index] = RNG->DR;
                ready = true;
                break;
            }
        }
        if (!ready)
        {
            return UINT64_C(0);
        }
    }
    const uint64_t boot_id = ((uint64_t)words[0] << 32U) | (uint64_t)words[1];
    return boot_id == 0U ? UINT64_C(0) : boot_id;
}

void DMA1_Channel1_IRQHandler(void)
{
    canview_stm_uart_platform_t *const platform = active_platform;
    const uint32_t flags = DMA1->ISR & CANVIEW_STM_UART_RX_DMA_FLAGS;
    if (flags != 0U)
    {
        DMA1->IFCR = CANVIEW_STM_UART_RX_DMA_CLEAR;
    }
    if (platform == NULL || !platform->started)
    {
        return;
    }
    if ((flags & (DMA_ISR_HTIF1 | DMA_ISR_TCIF1)) != 0U)
    {
        if ((flags & DMA_ISR_TCIF1) != 0U)
        {
            if (platform->rx_wrap_count_isr == UINT32_MAX)
            {
                platform->rx_error_pending = true;
                post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX_ERROR);
            }
            else
            {
                ++platform->rx_wrap_count_isr;
            }
        }
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX);
    }
    if ((flags & DMA_ISR_TEIF1) != 0U)
    {
        platform->rx_error_pending = true;
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX_ERROR);
    }
}

void DMA1_Channel2_IRQHandler(void)
{
    canview_stm_uart_platform_t *const platform = active_platform;
    const uint32_t flags = DMA1->ISR & CANVIEW_STM_UART_TX_DMA_FLAGS;
    if (flags != 0U)
    {
        DMA1->IFCR = CANVIEW_STM_UART_TX_DMA_CLEAR;
    }
    if (platform == NULL || !platform->started)
    {
        return;
    }
    if ((flags & DMA_ISR_TEIF2) != 0U)
    {
        platform->tx_error_pending = true;
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_TX_ERROR);
    }
    if ((flags & DMA_ISR_TCIF2) != 0U)
    {
        platform->tx_done_pending = true;
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_TX_DONE);
    }
}

void USART2_IRQHandler(void)
{
    canview_stm_uart_platform_t *const platform = active_platform;
    const uint32_t status = USART2->ISR;
    if ((status & CANVIEW_STM_UART_USART_ERROR_FLAGS) != 0U)
    {
        USART2->ICR = CANVIEW_STM_UART_USART_ERROR_CLEAR;
        USART2->RQR = USART_RQR_RXFRQ;
        if (platform != NULL && platform->started)
        {
            platform->rx_error_pending = true;
            post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX_ERROR |
                                      CANVIEW_STM_UART_PLATFORM_EVENT_RX);
        }
    }
    if ((status & USART_ISR_IDLE) != 0U)
    {
        USART2->ICR = USART_ICR_IDLECF;
        if (platform != NULL && platform->started)
        {
            post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX);
        }
    }
    if ((status & USART_ISR_CTSIF) != 0U)
    {
        USART2->ICR = USART_ICR_CTSCF;
        if (platform != NULL && platform->started)
        {
            post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_CTS);
        }
    }
}
